---
kind: method
id: M:Autodesk.Revit.ApplicationServices.Application.GetSystemsAnalysisWorkflowNames
source: html/3ec2a3c5-2534-6c0c-e08b-1ac02735292c.htm
---
# Autodesk.Revit.ApplicationServices.Application.GetSystemsAnalysisWorkflowNames Method

Returns names for systems analysis workflows.

## Syntax (C#)
```csharp
public IList<string> GetSystemsAnalysisWorkflowNames()
```

## Returns
An array of names of systems analysis workflows.

## Remarks
The array that is returned contains the name of the systems analysis workflow,
 in the order they are specified in Options.